Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E13A.tmx
Source language: en_us
Languages: zh_cn

source: MOJITO CUPCAKES
zh_cn: 莫吉托纸杯蛋糕

source: yield: 12 cupcakes
zh_cn: 产量：12个纸杯蛋糕

source: prep time: 30 minutes
zh_cn: 准备时间：30分钟

source: cook time: 25 minutes
zh_cn: 烘焙时间：25分钟

source: INGREDIENTS
zh_cn: 做纸杯蛋糕需要：

source: 1/2 cup buttermilk
zh_cn: 半杯牛奶

source: 1/2 cup mint leaves, bruised
zh_cn: 半杯擦好的薄荷叶

source: 1/2 cups all-purpose flour
zh_cn: 一杯加半杯通用面粉

source: 1 1/2 teaspoons baking powder
zh_cn: 一茶匙加半茶匙发酵粉

source: 1/4 teaspoon salt
zh_cn: 四分之一茶匙盐

source: 1/2 cup unsalted butter, at room temperature
zh_cn: 半杯室温下的无盐黄油

source: 1 cup granulated sugar
zh_cn: 一杯砂糖

source: 2 eggs, at room temperature
zh_cn: 两个室温下的鸡蛋

source: Zest and juice of 1 1/2 limes
zh_cn: 一杯加半杯酸橙皮加酸橙汁

source: 2 tablespoons white rum
zh_cn: 两汤匙白朗姆酒

source: 1/4 teaspoon vanilla extract
zh_cn: 四分之一茶匙香草精

source: To Brush the Cupcakes:
zh_cn: 刷纸杯蛋糕需要：

source: 2 sprigs fresh mint
zh_cn: 两枝新鲜薄荷

source: For the Frosting:
zh_cn: 糖霜需要：

source: 1 1/2 cups unsalted butter, at room temperature
zh_cn: 一杯加半杯室温下的无盐黄油

source: 4 1/4 cups powdered sugar
zh_cn: 四杯加四分之一杯糖粉

source: 1 1/2 tablespoons lime juice
zh_cn: 一汤匙加半汤匙柠檬汁

source: 3 tablespoons white rum
zh_cn: 三汤匙白朗姆酒

source: Combine the buttermilk and the cup mint leaves in a small saucepan over medium heat.
zh_cn: 把酪乳和半杯薄荷叶混合倒进一个小锅里，中火加热。

source: Warm until just starting to steam (do not simmer), then remove from the heat and cover.
zh_cn: 温热直到刚刚开始冒热气（不沸腾），然后关火揭盖。

source: Let steep for 15 to 30 minutes.
zh_cn: 让它浸泡15至30分钟。

source: Once finished, strain the milk into a bowl using a fine mesh sieve.
zh_cn: 一旦完成，用细网筛将牛奶滤入碗中。

source: The milk may appear curdled or clumpy, but don't worry, it will come back together.
zh_cn: 牛奶可能会出现凝结或块状，但不要担心，它会重新溶在一起。

source: Press on any milk solids and mint leaves to extract all the liquid possible.
zh_cn: 挤压乳固体和薄荷叶尽可能提取所有的液体。

source: Give the milk a quick stir to smooth it out and set aside.
zh_cn: 把牛奶快速的搅拌使其变得平滑，放一边备用。

source: While the mint is steeping in the milk, preheat the oven to 325 degrees F. Line a standard muffin tin with paper liners; set aside.
zh_cn: 当把薄荷浸泡在牛奶中时，预热烤箱到325华氏度。在标准松饼托上放上纸杯：放一边备用。

source: In a medium bowl, whisk together the flour, baking powder and salt; set aside.
zh_cn: 在一个中号碗里，将面粉，发酵粉和盐一起搅拌;放一边备用。

source: In an electric mixer on medium-high speed, beat the butter and sugar together until pale, light, and fluffy (about 5 minutes).
zh_cn: 用电动搅拌器以中高速，将黄油和糖打至发白，轻柔，蓬松（约5分钟）。

source: Reduce the mixer speed to medium and add the eggs one at at time, mixing thoroughly after each addition.
zh_cn: 降低搅拌器的速度至中速，逐个加入鸡蛋，每次加入后充分混合。

source: Scrape the sides of the bowl and add the lime zest, lime juice, vanilla extract and rum.
zh_cn: 刮干净碗边，并加入酸橙皮，酸橙汁，香草精和朗姆酒。

source: Mix until combined.
zh_cn: 搅拌至混合。

source: (The mixture may start to look curdled at this point, but don’t worry, it will all come back together, power on!)
zh_cn: （该混合物开始可能凝结于一点，但不要担心，它都会重合溶在一起，通电！）

source: Reduce the mixer speed low.
zh_cn: 降低搅拌速度低。

source: Add the dry ingredients in three batches, alternating with the buttermilk in two batches.
zh_cn: 分三批添加干的原料，乳酪分两批交替加入。

source: Mix only until just incorporated, using a rubber spatula to give it one last mix by hand.
zh_cn: 调配至刚刚混合，用橡胶铲手动搅拌最后一下。

source: Divide the batter between the muffin cups.
zh_cn: 将每两个松饼杯之间的糊状物划分开。

source: Bake for approximately 25 minutes or until just slightly golden and a skewer shows only moist crumbs attached, rotating the pan at the halfway point.
zh_cn: 烘焙约25分钟或者烤到颜色略呈金黄色，用针刺穿只有一点潮湿碎屑，转动锅的中间位置。

source: While the cupcakes are baking, combine the rum and mint sprigs in a small saucepan and warm over medium heat until the rum is heated through (do not let it simmer).
zh_cn: 当纸杯蛋糕在烘焙时，把朗姆酒和薄荷小枝混合倒入一个小锅里，并用中火加热，直到朗姆酒温热（不要让它沸腾）。

source: Remove the pan from the heat, cover, and let steep until ready to use.
zh_cn: 下锅揭盖，浸泡放凉，直到准备使用。

source: Allow cupcakes to cool for 5 to 10 minutes and then remove to a cooling rack.
zh_cn: 让蛋糕冷却5至10分钟，然后取出一个散热架。

source: Brush the tops of the cupcakes with the mint-infused rum.
zh_cn: 在纸杯蛋糕的顶部刷上薄荷混合的朗姆酒。

source: Set the cupcakes aside to cool completely before frosting them.
zh_cn: 将蛋糕放在一边，在刷上糖霜之前使它完全冷却。

source: To make the frosting, whip the butter on medium-high speed of an electric mixer using the whisk attachment for 5 minutes.
zh_cn: 做糖霜，用中高转速的电动搅拌器拂附件搅拌5分钟黄油。

source: Reduce the speed to medium-low and gradually add the powdered sugar, mixing and scraping the sides of the bowl until all is incorporated.
zh_cn: 降低到中低速，逐渐加入糖粉，混合和刮干净碗边，直至所有的东西都溶合。

source: Give it a mix on medium speed for about 30 seconds.
zh_cn: 中速混合它约30秒。

source: Add the lime juice and rum and mix on medium-high speed until incorporated and fluffy.
zh_cn: 加入酸橙汁和朗姆酒，以中高速拌匀直至充分混合，蓬松。

source: If the frosting appears a bit too soft, add some additional sugar, one spoonful at a time until desired consistency is reached.
zh_cn: 如果糖霜表现得有点太软了，再加些糖，一次加一匙，直至调到所需稠度为止。

source: Frost cupcakes and garnish, if desired, with a lime wedge and sprig of fresh mint.
zh_cn: 如果想要纸杯蛋糕上撒糖霜和装饰，可以用新鲜的薄荷枝和青柠角。
